import { nanoid } from 'nanoid'

function App() {
  let sum = 0;
  let kf = 0;
  let arr = [
    ['Ян Регенсбург', 1, 1, 'Ингольштадт-04', 'Ф1(-1)', 1.89, 300, "минус", '8.04.2022'],
    ['Погонь', 1, 2, 'Висла Плоцк', 'Ф1(-1)', 1.45, 300, "минус", '8.04.2022'],
    ['Шелбурн', 1, 2, 'Шемрок Роверс', 'П2', 1.45, 300, "плюс", '8.04.2022'],
    ['Мельбурн Виктори', 3, 0, 'Мельбурн Сити', 'П2', 2.15, 300, "минус", '9.04.2022'],
    ['Герта', 1, 4, 'Унион Берлин', 'Обе забьют - да', 2.08, 300, "плюс", '9.04.2022'],
    ['Газиантеп ББ', 0, 0, 'Трабзонспор', 'П2', 2.264, 300, "минус", '9.04.2022'],
    ['Тондела', 1, 3, 'Спортинг', 'Ф2(-1,5)', 1.93, 300, "плюс", '9.04.2022'],
    ['Тондела', 1, 3, 'Спортинг', 'Ф2(-1,5)', 1.80, 300, "плюс", '9.04.2022'],
    ['Анже', 1, 1, 'Лилль', 'П2', 2.2, 300, "минус", '10.04.2022'],
    ['Хераклес', 1, 4, 'Фейенорд', 'ТБ2,5', 1.66, 300, "плюс", '10.04.2022'],
    ['Айнтрахт', 1, 2, 'Фрайбург', 'Обе забьют-да', 1.72, 300, "плюс", '10.04.2022'],
    ['Кимпхо Ситизен', 2, 1, 'Кеннам', 'ТБ2,5', 1.84, 300, "плюс", '11.04.2022'],
    ['Мальмё', 1, 1, 'Эльфсборг', 'Ф1(-1)', 1.86, 300, "минус", '11.04.2022'],
    ['Хаддерсфилд Таун', 2, 0, 'Лутон', 'ТМ2,5', 1.68, 300, "плюс", '11.04.2022'],
    ['Сидней', 2, 3, 'Аделаида Юнайтед', 'П1', 1.75, 300, "минус", '12.04.2022'],
    ['Мельбурн Виктори', 0, 0, 'Брисбен Роар', 'ТБ2,5', 1.78, 300, "минус", '12.04.2022'],
    ['Реал Мадрид', 1, 3, 'Челси', 'Обе забьют-да', 1.67, 300, "плюс", '12.04.2022'],
    ['Реал Мадрид', 1, 3, 'Челси', 'Обе забьют-да', 1.63, 700, "плюс", '12.04.2022'],
    ['Бостон Брюинз', 2, 4, 'Сент-Луис Блюз', 'ИТ2 больше 2,5', 1.77, 300, "плюс", '13.04.2022'],
    ['Миннесота Вайлд', 5, 1, 'Эдмонтон Ойлерз', 'Ф1(0)', 1.74, 300, "плюс", '13.04.2022'],
    ['Перт Глори', 0, 1, 'Веллингтон феникс', 'ТБ2,5', 1.69, 300, "минус", '13.04.2022'],
    ['Вестерн Сидней Уондерс', 2, 2, 'Централ Кост Маринерс', 'ТБ2,5', 1.8, 300, "плюс", '13.04.2022'],
    ['Гамба Осака', 2, 0, 'Оита Тринита', 'ТБ2,5', 1.87, 300, "минус", '13.04.2022'],
    ['Ривер Плейт', 2, 0, 'Форталеза ЕК', 'ТБ2,5', 1.82, 300, "минус", '14.04.2022'],
    ['ПСВ', 1, 2, 'Лестер', 'ТБ2,5', 1.88, 700, "плюс", '14.04.2022'],
    ['ПАОК', 0, 1, 'Олимпик Марсель', 'Ф2(0)', 1.70, 300, "плюс", '14.04.2022'],
    ['Бостон Брюинз', 2, 3, 'Оттава Сенаторс', 'Ф1(-1)', 1.7, 300, "минус", '15.04.2022'],
    ['Макартур Сидней', 2, 1, 'Брисбен Роар', 'П1', 2.21, 300, "плюс", '15.04.2022'],
    ['Патхум', 1, 1, 'Мельбурн Сити', 'П2', 1.85, 300, "минус", '15.04.2022'],
    ['Шеффилд Юнайтед', 1, 2, 'Рединг', 'Ф1(0)', 2.08, 300, "минус", '15.04.2022'],
    ['Ренн', 2, 3, 'Монако', 'ТБ2,5', 1.7, 800, "плюс", '15.04.2022'],
    ['Вестерн Юнайтед', 6, 0, 'Перт Глори', 'ТБ2,5', 1.65, 300, "плюс", '16.04.2022'],
    ['Саутгемптон', 1, 0, 'Арсенал', 'П2', 2.05, 300, "минус", '16.04.2022'],
    ['Ювентус', 1, 1, 'Болонья', 'Ф1(-1,5)', 2.19, 300, "минус", '16.04.2022'],
    ['Фенербахче', 2, 0, 'Газтепе', 'Ф1(-1,5)', 1.98, 300, "плюс", '16.04.2022'],
    ['Колорадо Авеланш', 7, 4, 'Каролина Харикейнс', 'П1', 2.21, 300, "плюс", '17.04.2022'],
    ['Лос-Анджелес Кингс ', 2, 1, 'Коамбс Блю Джекетс', 'П1', 1.89, 300, "плюс", '17.04.2022'],
    ['Ницца', 2, 1, 'Лорьян', 'П1', 1.79, 300, "плюс", '17.04.2022'],
    ['Арминия', 0, 3, 'Бавария', 'Ф2(-2)', 1.72, 300, "плюс", '17.04.2022'],

  ];

  let result = arr.map((elem, ind) => {
    kf = (kf + elem[5])
    if (elem[7] === 'минус') {
      sum = sum - elem[6];
    } else if (elem[7] === 'возврат') {
      sum = sum + 0
    } else {
      sum = sum + (elem[6] * elem[5]) - elem[6];
    }

    return <>
      <tr key={nanoid()} style={{ backgroundColor: elem[7] === 'минус' ? '#ff8383' : '#2aff85' }}>
        <td>{elem[8]}</td>
        <td>{elem[0]}</td>
        <td>{elem[1]} {'-'} {elem[2]}</td>
        <td>{elem[3]}</td>
        <td>{elem[4]}</td>
        <td>{elem[5]}</td>
        <td>{elem[6]}</td>
        <td>{elem[7] === 'минус' ? -300 : elem[6] * elem[5] - elem[6]}</td>
      </tr>
    </>
  })


  return <>
    <table style={{ fontSize: '20px' }} >
      <thead>
        <tr style={{ backgroundColor: '#9ed7eb' }} >
          <td>Дата события</td>
          <td>Команда 1</td>
          <td>Счет</td>
          <td>Команда 2</td>
          <td>Ставка</td>
          <td>Кф.</td>
          <td>Сумма</td>
          <td>Прибыль/Убыток</td>
        </tr>
        {result}
        <tr style={{ backgroundColor: '#9ed7eb' }} >
          <td>Итог: {sum } руб.</td>
        </tr >
        <tr style={{ backgroundColor: '#9ed7eb' }} >
          <td>Средний коэффициент: {(kf / arr.length).toFixed(3)}</td>
        </tr>
        <tr style={{ backgroundColor: '#9ed7eb' }} >
          <td>Всего ставок: {arr.length}</td>
        </tr>
      </thead>
    </table>
  </>
}

export default App;
